import mod_winker
import mod_wiper
import mod_handle
page = 1

def fw():

    if page == 1:
        mod_handle.handle()  # 페이지가 1이면 핸들 연결

def fs():
    if page == 1:
        button() # 페이지가 1이면 내부버튼 연결

    elif page == 2:
        klaxon() # 페이지가 2이면 클랙슨 연결

def fa():
    if page == 2:
        light() # 페이지가 2이면 light 연결

def fd():
    if page == 2:
        mod_wiper.wiper()

def f1():
    if page == 2:
        mod_winker.winker()


#######################################################################################################################
# 임시 라이트 함수
def light():
    pass

# 클락션 함수
def klaxon():
    print("빵")
#######################################################################################################################

# 임시 엔진함수
def engine():
    return 1

#######################################################################################################################

#





fw()

