import time
import datetime
import threading


def snow():
    # print("===============================================================")
    # print('    ∧    ')
    # print("  / ! \\    하늘에서 눈이 내리기 시작했습니다. 와이퍼를 작동시켜 주세요!   ")
    # print(" ㅡ ㅡ ㅡ")
    # print("===============================================================")
    print("     ●         ●             ●      ●          ●               ●")
    time.sleep(1)
    print("  ●           ●         ●                ●             ●        ●")
    time.sleep(1)
    print("        ●           ●         ●        ●           ●         ●   ")
    time.sleep(1)
    print("  ●          ●          ●          ●                  ●           ●")
    time.sleep(0.5)


#
# time.sleep(2)
def wi():
    i = 0
    while True:
        print("""                                      /
                                     /
                                    /
                                   /
                                  /
                                 /
                                /
                               /
                              /
ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ""")

        time.sleep(1)
        print("""                      \\
                               \\
                                \\
                                 \\
                                  \\
                                   \\
                                    \\
                                     \\
                                      \\
ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ""")
        i += 1
        time.sleep(1)

        if i == 2:
            break


def wi2():
    i = 0
    while True:
        print("""                                      /
                                     /
                                    /
                                   /
                                  /
                                 /
                                /
                               /
                              /
ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ""")

        time.sleep(0.5)
        print("""                      \\
                               \\
                                \\
                                 \\
                                  \\
                                   \\
                                    \\
                                     \\
                                      \\
ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ""")
        i += 1
        time.sleep(0.5)

        if i == 2:
            break


def washer_fluid():
    i = 0
    while True:
        print("""                                      
                     \\        |        /
                      \\       |       /
                       \\      |      /
                        \\     |     /
                         \\    |    /
                          \\   |   /
                           \\  |  /
                            \\ | /
ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ""")

        time.sleep(0.5)
        print("""                                      



                       \\     |     /
                        \\    |    /
                         \\   |   /
                          \\  |  /
                           \\ | /
ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ""")

        time.sleep(0.5)
        print("""                                      






                           \\  |  /
                            \\ | /
ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ""")
        i += 1
        time.sleep(0.5)
        if i == 1:
            break


# t = threading.Thread(target=wi)
# t.start()
#
# j = 0
# while True :
#     print("""                      \\
#                        \\
#                         \\
#                          \\
#                           \\
#                            \\
#                             \\
#                              \\
#                               \\
# ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ""")
#     j += 1
#     time.sleep(1.3)
#     if j == 3 :
#         break
# print()
# print()
# print()
# print("                       와이퍼 작동을 중지합니다  ")
# print("ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ")

#
#
#
#
#
#
#
# print("""========================================================================
#         (  )               /         〃          /
#        (    )             /         〃          /
#         ｜ ｜             /         〃          /
#         ｜ ｜            /         〃          /             (  )
#         ｜ ｜           /         〃          /             (    )
#                       /         〃          /               ｜ ｜
#                      /         〃          /                ｜ ｜
#                     /         〃          /                 ｜ ｜
#                    /         〃          /
#                   /         〃          /
# ========================================================================""")
#
#
# print("===============================================================")
# print('    ∧    ')
# print("  / ! \\    아이가 갑자기 튀어나왔습니다! 브레이크를 밟으세요!  ")
# print(" ㅡ ㅡ ㅡ")
# print("===============================================================")
#
#

def kid():
    print("""========================================================================
            (  )               /         〃          /
           (    )             /         〃          /
            ｜ ｜      ○ 　   /         〃          /
            ｜ ｜     /｜\\　  /         〃          /             (  )
            ｜ ｜      /\\   /         〃          /             (    )
                          /         〃          /               ｜ ｜
                         /         〃          /                ｜ ｜
                        /         〃          /                 ｜ ｜
                       /         〃          /
                      /         〃          /
    ========================================================================""")